import telebot
from telebot.types import ReplyKeyboardMarkup, KeyboardButton
import random

bot = telebot.TeleBot("token bot")


joks = [
    "چرا کامپیوتر نمی‌تونه شنا کنه؟ چون از ویروس می‌ترسه!",
    "یه برنامه‌نویس وارد کافه میشه... سفارش صفر یا بیشتر قهوه میده.",
    "فرق بین کد خوب و بد چیه؟ کد خوب می‌دونه کی وقت رفتنه!",
    "وقتی برنامه‌نویس می‌گه 'الان درستش می‌کنم'، یعنی: خدا به داد برسه.",
    "خطای 404: جوک پیدا نشد!",
    "چرا اسکلت نمی‌تونه مهمونی بره؟ چون دل نداره!",
    "چرا گیتار رفت پیش روان‌شناس؟ چون سیم‌هاش کش اومده بود.",
    "یه بار یه بیت و بایت با هم دعواشون شد... اینترنت قطع شد!",
    "سیم برق به لامپ گفت: بدون من هیچ نوری نداری!",
    "شوهر برنامه‌نویس به زنش گفت: تو exception زندگی منی!",
    "تو زندگی یا باگ می‌گیری، یا دیباگ می‌کنی!",
    "اگر زندگی سخت شد، چندتا خط لاگ بنداز ببین چی شده.",
    "جوک‌ها مثل توابع بازگشتی‌ان—تا نخندی برنمی‌گردن!",
    "آدم باید مثل الگوریتم باشه، مرتب و منطقی.",
    "جلسه تیمی برنامه‌نویسا همیشه با یک جمله شروع میشه: 'الان دقیقا چی شکست خورد؟'",
    "برنامه‌نویس واقعیه اونی‌ـه که بعد از کار، کد خواب می‌بینه.",
    "چرا کلاه‌بردارها به پایتون علاقه دارن؟ چون همه‌چیز دینامیکه!",
    "زندگی یعنی حلقه‌ای بی‌پایان از تلاش و استثنا.",
    "پیتون یا پایتون؟ مهم اینه که مار گاز نگیره!",
    "بزرگترین ترس برنامه‌نویس؟ وقتی که یه باگ خودش درست شه!",
    "وقتی سرور خواب رفت، مشتری گفت: 'بیدارش کن!'",
    "تولد یه کدنویس بدون کیک نیست—اما پر از برگه‌های تسک‌ـه!",
    "می‌دونی چرا کامپیوترها شوخی نمی‌فهمن؟ چون فقط صفر و یکن!",
    "توی جنگ بین CSS و JS، طراحی مرد!",
    "حافظه‌ام پر شده، چون هر جوکی رو که شنیدم حفظ کردم!"
]


facts = [
    "بدن انسان حدود ۶۰٪ از آب تشکیل شده.",
    "زنبورها می‌توانند رنگ‌های ماورای بنفش را ببینند.",
    "مرغ‌ها می‌توانند بیش از ۱۰۰ چهره‌ی مختلف انسان را به خاطر بسپارند.",
    "قلب نهنگ آبی به اندازه‌ی یک خودرو کوچک است.",
    "یک روز در سیاره‌ی زهره طولانی‌تر از یک سال آن است.",
    "در قطب جنوب، بارش باران تقریباً وجود ندارد؛ اما آنجا رسماً یک بیابان است!",
    "انسان‌ها و موزها ۵۰٪ از DNA مشترک دارند.",
    "هشت‌پاها سه قلب دارند.",
    "حلزون‌ها می‌توانند تا سه سال بخوابند.",
    "زرافه‌ها هیچ سیم صوتی ندارند و تقریباً بی‌صدا هستند.",
    "در ژاپن، سنت وجود دارد که در روز تولد ۱۰۰ سالگی، دولت به افراد یک فنجان نقره‌ای هدیه می‌دهد.",
    "نور خورشید حدود ۸ دقیقه طول می‌کشد تا به زمین برسد.",
    "در بدن انسان، باکتری‌ها از سلول‌های بدن بیشتر هستند.",
    "طولانی‌ترین کلمه‌ای که می‌توان در زبان انگلیسی تایپ کرد بدون تکرار حروف: 'uncopyrightable'.",
    "کوآلاها اثر انگشتی شبیه انسان دارند.",
    "شیر تنها گربه‌ای است که در گروه‌های اجتماعی زندگی می‌کند.",
    "اسب‌های آبی عرق قرمز رنگ ترشح می‌کنند که ضدباکتری است.",
    "هر پنگوئن جفت منحصر‌به‌فرد خود را با صدا می‌شناسد.",
    "مغز انسان بیشتر از مغز هر حیوان دیگری انرژی مصرف می‌کند.",
    "هر فرد به‌طور متوسط در طول عمر خود حدود ۳۵ تن غذا می‌خورد.",
    "آب گرم سریع‌تر از آب سرد یخ می‌زند (اثر امپمبا).",
    "چین بزرگ‌ترین تولیدکننده‌ی پنل‌های خورشیدی در دنیاست.",
    "در فضا نمی‌توان بدون ابزار، گریه کرد چون اشک‌ها نمی‌چکند.",
    "صدای شکستن بند انگشت‌ها در واقع ناشی از ترکیدن حباب‌های گاز است.",
    "در بدن انسان حدود ۹۶٬۰۰۰ کیلومتر رگ خونی وجود دارد!"
]


@bot.message_handler(commands=['start'])
def start_one(message):
	markup = ReplyKeyboardMarkup(resize_keyboard=True)
	button_joks = KeyboardButton('جوک بگو')
	button_fact = KeyboardButton('فکت بگو')
	markup.add(button_joks, button_fact)
	
	bot.reply_to(message, 'اینجا جوک و فکت میشنوی✓✓✓', reply_markup=markup)
	
@bot.message_handler(func=lambda message: message.text == "جوک بگو")
def jok(message):
	random_joks = random.choice(joks)
	bot.reply_to(message, random_joks)
	
@bot.message_handler(func=lambda message : message.text == "فکت بگو")
def fact(message):
	random_fact = random.choice(facts)
	bot.reply_to(message, random_fact)
	
print("بات فعال است✓✓✓")
bot.polling()