import telebot
from telebot.types import ReplyKeyboardMarkup, KeyboardButton
import random

bot = telebot.TeleBot("7202072119:AAGhv3T1RVj9TrATLJUoUmbMZfoniFR2Fos")


joks = [
    "چرا کامپیوتر نمی‌تونه شنا کنه؟ چون از ویروس می‌ترسه!",
    "یه برنامه‌نویس وارد کافه میشه... سفارش صفر یا بیشتر قهوه میده.",
    "فرق بین کد خوب و بد چیه؟ کد خوب می‌دونه کی وقت رفتنه!",
    "وقتی برنامه‌نویس می‌گه 'الان درستش می‌کنم'، یعنی: خدا به داد برسه.",
    "خطای 404: جوک پیدا نشد!",
    "چرا اسکلت نمی‌تونه مهمونی بره؟ چون دل نداره!",
    "چرا گیتار رفت پیش روان‌شناس؟ چون سیم‌هاش کش اومده بود.",
    "یه بار یه بیت و بایت با هم دعواشون شد... اینترنت قطع شد!",
    "سیم برق به لامپ گفت: بدون من هیچ نوری نداری!",
    "شوهر برنامه‌نویس به زنش گفت: تو exception زندگی منی!",
    "تو زندگی یا باگ می‌گیری، یا دیباگ می‌کنی!",
    "اگر زندگی سخت شد، چندتا خط لاگ بنداز ببین چی شده.",
    "جوک‌ها مثل توابع بازگشتی‌ان—تا نخندی برنمی‌گردن!",
    "آدم باید مثل الگوریتم باشه، مرتب و منطقی.",
    "جلسه تیمی برنامه‌نویسا همیشه با یک جمله شروع میشه: 'الان دقیقا چی شکست خورد؟'",
    "برنامه‌نویس واقعیه اونی‌ـه که بعد از کار، کد خواب می‌بینه.",
    "چرا کلاه‌بردارها به پایتون علاقه دارن؟ چون همه‌چیز دینامیکه!",
    "زندگی یعنی حلقه‌ای بی‌پایان از تلاش و استثنا.",
    "پیتون یا پایتون؟ مهم اینه که مار گاز نگیره!",
    "بزرگترین ترس برنامه‌نویس؟ وقتی که یه باگ خودش درست شه!",
    "وقتی سرور خواب رفت، مشتری گفت: 'بیدارش کن!'",
    "تولد یه کدنویس بدون کیک نیست—اما پر از برگه‌های تسک‌ـه!",
    "می‌دونی چرا کامپیوترها شوخی نمی‌فهمن؟ چون فقط صفر و یکن!",
    "توی جنگ بین CSS و JS، طراحی مرد!",
    "حافظه‌ام پر شده، چون هر جوکی رو که شنیدم حفظ کردم!"
]


@bot.message_handler(commands=['start'])
def start_one(message):
	markup = ReplyKeyboardMarkup(resize_keyboard=True)
	button = KeyboardButton('جوک بگو')
	markup.add(button)
	
	bot.reply_to(message, "میخای جوک بشنوی پس بزن بریم ✓✓✓", reply_markup=markup)
	
@bot.message_handler(func=lambda message: message.text == "جوک بگو")
def jok(message):
	random_joks = random.choice(joks)
	bot.reply_to(message, random_joks)
	
print("بات فعال است✓✓✓")
bot.polling()